system/functions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      functions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeFunc MachNo
#includeFunc residuals
/*
Настройте параметры объекта MachNo (при необходимости). Пример конфигурации:
MachNo1 {
    type MachNo;
    libs (fieldFunctionObjects);
    // Опциональные параметры
    field <inpField>;
    result <fieldResult>;
    region region0;
    enabled true;
    log true;
    timeStart 0;
    timeEnd 1000;
    executeControl timeStep;
    executeInterval 1;
    writeControl timeStep;
    writeInterval 1;
}
Некоторые ключевые параметры:
type — обязательный параметр, указывающий тип объекта (должен быть MachNo);
libs — библиотека, с которой связывается объект (обычно fieldFunctionObjects);
field и result — поля, из которых берётся входное и выходное значения;
region — регион, для которого выполняется расчёт;
enabled, log, timeStart, timeEnd и другие параметры управления выполнением и записью результатов.
 * */
// ************************************************************************* //
